resources/e2eTestData.json


{
    "payments": {
        "insertPayment": {
            "title": "string",
            "description": "string",
            "status": 1,
            "amount": 43,
            "currency": "string",
            "startts": 10,
            "endts": 13,
            "type": 1,
            "frequency": 10
        },
        "updatePayment": {
            "id": "63c684fe-8a97-11e8-b99f-9f38301a1e03",
            "title": "string",
            "description": "string",
            "promo": "string",
            "status": 1,
            "customerAddress": "string",
            "amount": 43,
            "currency": "string",
            "startts": 10,
            "endts": 13,
            "type": 1,
            "frequency": 10,
            "transactionHash":"string",
            "debitAccount": "string"
        }
    }
}